#### BuiltInFailures.MassFailures Members

---

|  |
| --- |
| BuiltInFailures MassFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures MassFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AutoGlazingFailed | Failure in Auto-Glazing region computation. |
| Public property Static member | AutoGlazingFailedError | Failure in Auto-Glazing region computation. |
| Public property Static member | BooleanUnionFailed | Failed to merge overlapping solids |
| Public property Static member | CannotIntegrate | In order to restore an element's 'Constrain to Massing' property to 'Dependent', it must be in the main model with the massing. |
| Public property Static member | CannotMergeGeometry | The Mass contains geometry that cannot be combined. Mass Floors, volume, and surface area, won't be computed. |
| Public property Static member | CannotMoveMassing | Can't move whole Massing. Move the elements within the Massing instead. |
| Public property Static member | CreateCoreGeometryFailed | Failed to create core geometries. |
| Public property Static member | DividePerimeterZoneFailed | Failed to divide perimeter zone. |
| Public property Static member | FaceRegionCreationFailed | Failure in face region creation. |
| Public property Static member | FaceSplitFailed | A face of a joined (i.e. one cuts another) mass could not be split into interior and exterior faces. Remove the cut to resolve. |
| Public property Static member | FloorAreaFaceFailed | Failed to create a Mass Floor. |
| Public property Static member | FloorMightLookWrong | Mass Floors may appear incorrect since the Mass contains mesh and solid geometry. |
| Public property Static member | FloorRecreateFailed | The floor cannot be created. |
| Public property Static member | FloorRecreateFailedWarning | The floor cannot be created because no suitable level in the target document can be found. |
| Public property Static member | MinSkylightWidthImperial | The minimum skylight width is 8 inches. |
| Public property Static member | MinSkylightWidthMetric | The minimum skylight width is 203.2 millimeters. |
| Public property Static member | MultipleMassing | Can't complete operation. Massing can only exist in one Workset. Change Workset of Massing to match in Local and Central Models. |
| Public property Static member | NoCurtainRoofsInMassing | Massing cannot be created with a curtain roof. Please change the default roof type and try again. |
| Public property Static member | NonOccupiableMassZone | For mass zone, if the bottom level ref does not intersect, then this zone is going to be "not occupiable" and a warning is posted for it. |
| Public property Static member | NoSolidInMass | Mass contains no solid geometry. Mass Floors, volume, and surface area, won't be computed. |
| Public property Static member | OpenAndSolidGeometry | Mass contains both solid and mesh geometry. Mass Floors, volume, and surface area, may appear incorrect. |
| Public property Static member | OpenGeometryOnly | Mass contains only mesh geometry, which can't be used to compute Mass Floors, volume, or surface area. |
| Public property Static member | OverlappingSolids | Found volumetric overlap between solids. They will be merged into one |
| Public property Static member | SketchCurveNotModelable | This action cannot be completed. An element created by massing has a sketch line that cannot be modeled. |
| Public property Static member | SplitFacesByGroundPlaneCrashed | Failed to split face by ground plane. |
| Public property Static member | SplitFacesByGroundPlaneFailed | Failed to split face by ground plane. |
| Public property Static member | SplitOverlappingFacesFailed | Failed to resolve all overlaps between faces of the same Mass Energy Analytical Model. |
| Public property Static member | TooManyGeometries | The geometry in this Mass instance is too complex to take advantage of the capabilities a Mass provides. Please break it down into multiple Mass and family instances that are less complex. |
| Public property Static member | UpgradedMassingWarning | Your document contained a Massing element which has been upgraded to a Mass instance. Please review the documentation on the new enhanced Mass capabilities to understand the implications of this change. |

# See Also

BuiltInFailures MassFailures Class

Autodesk.Revit.DB Namespace